---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference.ArcReferenceType
source: html/10090f36-abce-fbe9-ce0e-f56b1958a8a1.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference.ArcReferenceType Property

The choice of rule for measuring the diameter.

## Syntax (C#)
```csharp
public RebarShapeArcReferenceType ArcReferenceType { get; }
```